05 MY-VAR PIC 9(6) VALUE 12345.

PROCEDURE DIVISION.

    ADD 1 TO MY-VAR.
    IF MY-VAR > 99999 THEN
        DISPLAY "OVERFLOW OCCURRED"
    ELSE
        DISPLAY MY-VAR
    END-IF.
    GOBACK.

END PROGRAM.